const warningIcon = '<img width="48" height="48" src="https://img.icons8.com/color/48/high-importance--v1.png" alt="high-importance--v1"/> ';

const herbsData = [
    { 
        name:warningIcon+'พิษนาศน์',
        otherNames:"แผ่นดินเย็น (อุบลราชธานี) นมราชสีห์ นมฤาษี ถั่วดินโคก",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph070_Piznard/ph070_3.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  ราก ฝนกับน้ำดื่ม ช่วยลดไข้ในเด็ก ฝนทาแก้พิษงู(ต้องว่าคาถาด้วย) ต้มน้ำดื่ม บำรุงน้ำนม (กินมากไม่ดี) ราก เหง้า ลำต้น ใบ ฝนทาฝี ยาพื้นบ้านอีสาน  ใช้  ราก ฝนน้ำทา แก้ฝี",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=78"
    },{ 
        name:warningIcon+"เทพทาโร",
        otherNames:"ข่าต้น (ภาคกลาง), จะไคต้น, จะไคหอม (ภาคเหนือ), จวง, จวงหอม (ภาคใต้) ,มะแดกกะมางิง (มลายู), หวางจาง (จีน)",
        imageUrl:"http://clgc.agri.kps.ku.ac.th/images/resource/fragrant/citronella_laurel/cinnamomum_03.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  ราก ฝนกับน้ำดื่ม ช่วยลดไข้ในเด็ก ฝนทาแก้พิษงู(ต้องว่าคาถาด้วย) ต้มน้ำดื่ม บำรุงน้ำนม (กินมากไม่ดี) ราก เหง้า ลำต้น ใบ ฝนทาฝี ยาพื้นบ้านอีสาน  ใช้  ราก ฝนน้ำทา แก้ฝี",
        source:"http://clgc.agri.kps.ku.ac.th/resources/new-fragrant/cinnamomum.html"
    },{ 
        name:warningIcon+"มะตูมนิ่ม",
        otherNames:"",
        imageUrl:"https://farm.vayo.co.th/blog/wp-content/uploads/2023/03/มะตูมนิ่ม-01-1-scaled.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  ราก ฝนกับน้ำดื่ม ช่วยลดไข้ในเด็ก ฝนทาแก้พิษงู(ต้องว่าคาถาด้วย) ต้มน้ำดื่ม บำรุงน้ำนม (กินมากไม่ดี) ราก เหง้า ลำต้น ใบ ฝนทาฝี ยาพื้นบ้านอีสาน  ใช้  ราก ฝนน้ำทา แก้ฝี",
        source:"https://farm.vayo.co.th/blog/aegle-marmelos-2/"
    },{
        name:warningIcon+"มะหาด",
        otherNames:"หาด (ทั่วไป) มะหาดใบใหญ่ (ตรัง) หาดขนุน ปวกหาด (เหนือ) ขนุนป่า",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/images/thumbnail/1383322652.JPG",
        benefits:"ตำรายาไทย ผงจากแก่น โดยนำแก่นไม้ที่อายุ 5 ปีขึ้นไป มาสับแล้วนำไปต้มเคี่ยวกับน้ำ จนเกิดฟอง ช้อนฟองที่ได้รวมกันทำให้แห้ง จะได้ผงสีขาวนวลจับกันเป็นก้อน นำไปย่างไฟให้เหลือง แล้วนำมาบดเป็นผง เรียกว่า “ผงปวกหาด” มีรสร้อนเมา นำมาชงกับน้ำเย็นรับประทาน เป็นยาขับพยาธิตัวตืดและพยาธิไส้เดือน หรือใช้ละลายน้ำ ทาแก้ผื่นคัน แก่น รสร้อน ขับพยาธิตัวตืด แก้ลม แก้ท้องอืดเฟ้อ แก้กษัย แก้เส้นเอ็นพิการ แก้เบื่ออาหาร แก้ลม ขับโลหิต ละลายเลือด ขับปัสสาวะ แก้ไข้ต่างๆ แก้น้ำเหลืองเสีย แก้ประดงทุกชนิด แก้หอบหืด แก้เสมหะ ราก แก้ไข้ ขับพิษร้อนใน ขับพยาธิ แก้กษัยในเส้นเอ็น เปลือกต้น รสฝาด ใช้เคี้ยวกับหมากแทนสีเสียด เปลือกต้นสด สมาน ทาขับพยาธิ ต้มกินแก้ไข้ ขับพยาธิ ผลสุก รับประทานได้ รสหวานอมเปรี้ยว",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=187"
    },{
        name:warningIcon+"เร่ว",
        otherNames:"เร่วหอม",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/images/thumbnail/1340637017.JPG",
        benefits:'ตำรายาไทย: ผลเร่วน้อย รสร้อนเผ็ดปร่า แก้ไข้ แก้ริดสีดวง แก้หืดไอ เสมหะ แก้ระดูขาว แก้ไข้สันนิบาต เมล็ดเร่วน้อย รสร้อนเผ็ดปร่า ขับลมในลำไส้ แก้ท้องขึ้น อืดเฟ้อ ปวดท้อง แก้คลื่นเหียน อาเจียน แก้ริดสีดวง หืดไอ กัดเสมหะ แก้ไข้สันนิบาต ขับน้ำนม ผลเร่วใหญ่ รสมันเฝื่อนติดเปรี้ยว แก้ไข้เพื่อดีและเสมหะ แก้ริดสีดวงทวารทั้ง 9 รักษาอาการขัดในทรวง บรรเทาอาการกระหายน้ำ แก้ธาตุพิการ แก้ท้องอืดเฟ้อจุกเสียด แก้ปวดท้อง แก้มุตกิดระดูขาว แก้หืดไอ แก้เสมหะอันบังเกิดแต่ดี แก้โลหิตขึ้นเบื้องสูง แก้ไข้สันนิบาต ขับผายลม ทำให้เรอ เมล็ดเร่วใหญ่ รสร้อนเผ็ดปร่า ขับลม แก้ท้องอืดท้องเฟ้อ ขับน้ำนมหลังคลอด แก้ปวดท้อง แก้คลื่นเหียนอาเจียน ลดไขมันในเลือด ลดความเป็นพิษของสารพิษต่อตับ แก้ริดสีดวง หืดไอ  ขับเสมหะ แก้ความดันโลหิตต่ำ แก้ไข้สันนิบาต',
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=117"
    },{
        name:warningIcon+"หัวร้อยรู",
        otherNames:"กระเช้าผีมด",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/userfiles/image/tcd148_Hua100ruu/tcd148_01.JPG",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  ราก ฝนกับน้ำดื่ม ช่วยลดไข้ในเด็ก ฝนทาแก้พิษงู(ต้องว่าคาถาด้วย) ต้มน้ำดื่ม บำรุงน้ำนม (กินมากไม่ดี) ราก เหง้า ลำต้น ใบ ฝนทาฝี ยาพื้นบ้านอีสาน  ใช้  ราก ฝนน้ำทา แก้ฝี",
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=148"
    },{
        name:"กระทุ่มนา",
        otherNames:"กระทุ่มดง (กาญจนบุรี) กระทุ่มนา กระทุ่มน้ำ (กลาง) กาตูม (เขมร-ปราจีนบุรี) ตำ (เขมร-สุรินทร์) ตุ้มแซะ ตุ้มน้อย ตุ้มน้ำ (เหนือ) ถ่มพาย (เลย) ท่อมขี้หมู (สงขลา) ท่อมนา (สุราษฎร์ธานี) โทมน้อย (เพชรบูรณ์) กระท่อมขี้หมู",
        imageUrl:"https://medthai.com/wp-content/uploads/2015/06/ดอกกระทุ่มนา.jpg",
        benefits:'ใบ เมื่อเคี้ยวมีรสขม มีอัลคาลอยด์หลายชนิด ช่วยลดความดันโลหิตและออกฤทธิ์กดประสาทและกล้ามเนื้อในสัตว์ทดลอง เปลือกต้น รสฝานร้อน รักษาโรคผิวหนังทุกชนิด แก้มะเร็งคุดทะราด แก้บิดมูกเลือด',
        source:"http://clgc.agri.kps.ku.ac.th/resources/old-fragrant/mitragyna.html"
    },{
        name:"ขันทองพยาบาท",
        otherNames:"ดูกใส (อีสาน) ยางปลอก ยายปลวก ฮ่อสะพานควาย (แพร่ น่าน) ขันทองพยาบาท (ภาคกลาง) ดูกหิน (สระบุรี) ข้าวตาก (กาญจนบุรี) มะดูกเลื่อม (เหนือ) ขันทอง (พิษณุโลก) ขุนทอง (ประจวบคีรีขันธ์) กระดูก (ใต้) ป่าช้าหมอง ดูกไทร ขอบนางนั่ง สลอดน้ำ มะดูกดง ข้าวตาก ขนุนดง เจิง",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/images/thumbnail/1383992998.jpg",
        benefits:"ตำรายาไทย ราก  รสเมาเบื่อร้อน แก้ลม แก้ประดง แก้พิษในกระดูก แก้โรคผิวหนัง รักษาน้ำเหลืองเสีย  เปลือกต้น รสเมาเบื่อ แก้โรคตับพิการ แก้ปอดพิการ แก้ลมเป็นพิษ แก้โรคผิวหนัง แก้กลากเกลื้อน รักษามะเร็ง รักษามะเร็งคุด เป็นยาถ่าย เป็นยาระบาย เป็นยาบำรุงเหงือก แก้เหงือกอักเสบ ทำให้เหงือกแข็งแรง ทำให้ฟันทน แก้ประดง ถ่ายน้ำเหลือง แก้พิษในกระดูก ฆ่าพยาธิ แก้โรคเรื้อน คุดทะราด แก้กามโรค เนื้อไม้ รสเมาเบื่อ แก้กามโรค แก้น้ำเหลืองเสีย แก้ไข้ แก้โรคผิวหนัง แก้มะเร็งคุดทะราด แก้กลากเกลื้อน แก้ลมพิษ แก้ประดงผื่นคัน แก้ประดง แก้พิษในกระดูก ฆ่าพยาธิ แก้โรคเรื้อน แก้ลมและโลหิตเป็นพิษ เนื้อไม้ มีพิษทำให้เมา ใช้เป็นยาเบื่อ  ลำต้น ต้มอาบสำหรับหญิงอยู่ไฟ ไม่ระบุส่วนที่ใช้ แก้ลมเป็นพิษ แก้พิษต่างๆ แก้ลมพิษ แก้พิษในกระดูก แก้โรคประดง แก้โรคผิวหนัง ฆ่าพยาธิผิวหนัง แก้โรคมะเร็ง คุดทะราด แก้กามโรค ฆ่าพยาธิ แก้โรคเรื้อน แก้กลากเกลื้อน ฆ่าพยาธิโรคเรื้อน",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=206"
    },{
        name:"จุกโรหินี",
        otherNames:"กล้วยไม้ โกฐพุงปลา พุงปลาช่อน เถาพุงปลา นมตำไร บวบลม",
        imageUrl:"https://ananhosp.go.th/สมุนไพร/3.1.14%20อื่นๆ/16%20จุกโรหินี.png",
        benefits:"ทั้งต้น รสฝาดสุขุม ต้มน้ำดื่ม แก้ปวดท้อง เนื่องจากโรคกระเพาะอาหารอักเสบ<br>ใบ รสฝาดสุขม ใช้เป็นยาฝาดสมาน แก้ท้องร่วง แก้ท้องเดิน แก้บิด แก้อาเจียน แก้ปวดเบ่ง มูกเลือด เสมหะผิดปกติ ใช้ภายนอกเป็นยาสมานแผล<br>ราก รสฝาดสุขุม แก้ท้องร่วง แก้อาเจียน แก้บิด แก้ปวดเบ่ง แก้เสมหะพิการ สมานแผล แก้ไข้เพื่อโลหิต แก้ลมปลายไข้ ใช้ภายนอกเป็นยาสมานแผล รากนำมาเคี้ยวกับพลู เป็นยาแก้ไอ<br>ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี: ใช้ ทั้งต้น เข้ายาแก้โรคตับพิการ เถา ต้มน้ำดื่ม แก้ท้องอืด ท้องเฟ้อ ขับลม<br>ยาสมุนไพรพื้นบ้านจังหวัดนครราชสีมา: ใช้ ราก ทาแผล เพื่อสมานแผล",
        source:"https://ananhosp.go.th/สมุนไพร/3.1.14%20อื่นๆ/16%20จุกโรหินี.html"
    },{
        name:"ชะเอมไทย",
        otherNames:"ชะเอมป่า(กลาง) ตาลอ้อย(ตราด) ส้มป่อยหวาน(พายัพ) อ้อยช้าง(สงขลา) นราธิวาส อ้อยสามสวน (อุบลราชธานี) กอกกั๋น ย่านงาย",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph031_Chaempaa/ph031_6.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้ ลำต้น เข้ากับเครือไส้ไก่ เครือหมาว้อ เครือตากวง ต้มน้ำดื่ม แก้โรคตับ เปลือกต้น ต้มน้ำดื่ม แก้ไอ ราก ช่วยแก้กระหาย ยาระบาย เนื้อไม้ บรรเทาอาการเจ็บคอ<br>ตำรายาไทย  ใช้ เนื้อไม้ มีรสหวาน แก้โรคในลำคอ แก้ลม แก้เลือดออกตามไรฟัน บำรุงธาตุและบำรุงกำลัง บำรุงกล้ามเนื้อให้เจริญ แก้ไอ ขับเสมหะ แก้น้ำลายเหนียว ต้น รสหวานเอียน ถ่ายลม แก้โรคในคอ ทำผิวหนังให้สดชื่น แก้โรคตา ราก มีรสหวาน ทำให้ชุ่มคอ แก้กระหายน้ำ และเป็นยาระบาย มีสรรพคุณแก้ไอ ขับเสมหะ แก้เจ็บคอ แก้โลหิตอันเน่าในอุทร และเจริญซึ่งหทัยวาตให้สดชื่น แก้กำเดาให้เป็นปกติ ใบ รสร้อนเฝื่อน ขับโลหิตระดู ดอก รสขมร้อน ช่วยย่อยอาหาร ทำเสมหะให้งวด แก้ดี และโลหิต ผล ขับเสมหะ",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=41"
    },{
        name:"ชิงชี่",
        otherNames:"กระดาดป่า (ชลบุรี) ชายชู้ หมากมก (ชัยภูมิ) หนวดแมวแดง (เชียงใหม่) คายซู (อุบลราชธานี) พญาจอมปลวก กระดาดขาว กระโรกใหญ่ กินขี้ จิงโจ้ แสมซอ ค้อนฆ้อง ซิซอ เม็งซอ ราม แส้ม้าทะลาย พุงแก น้ำนอง น้ำนองหวะ เม็งซอ พวงมะละกอ",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph226_Chingchee/ph226_005.jpg",
        benefits:"ตำรายาไทย ราก รสขมขื่น แก้โรคที่เกิดในท้อง ขับลมภายใน แก้ไข้ร้อนทุกชนิด ไข้พิษ แก้โรคตา โรคกระเพาะ รักษามะเร็ง ช่วยให้มดลูกเข้าอู่ และเป็นยาบำรุงหลังคลอดบุตร แก้ไอเนื่องจากหลอดลมอักเสบ แก้หืด  รากชิงชี่ใช้ใน “พิกัดเบญจโลกวิเชียร” (ยาแก้วห้าดวง หรือยาห้าราก) ซึ่งได้จากรากไม้ 5 ชนิดคือ รากชิงชี่ รากคนทา รากเท้ายายม่อม รากมะเดื่อชุมพร และรากย่านาง มีสรรพคุณ แก้ไข้ต่างๆ กระทุ้งพิษหรือถอนพิษต่างๆ ทั้งต้น รสขื่นปร่า ตำพอกแก้ฟกช้ำ บวม แก้ไข้ ขับน้ำเหลืองเสีย ใบ รสเฝื่อนเมา เข้ายาอาบ แก้โรคผิวหนัง รักษาประดง ใบต้มดื่ม แก้โรคผิวหนัง แก้สันนิบาต ไข้ฝีกาฬ แก้ตะคริว ใบเผาเอาควันสูดแก้หลอดลมอักเสบ ไข้พิษ ฝีกาฬ ไข้สันนิบาต รากและใบ แก้หืด แก้เจ็บในทรวงอก เป็นยาระงับความร้อน กระทุ้งพิษไข้ออกหัด อีสุกอีใส ตำพอกแก้ฟกช้ำบวม  ดอก รสขื่นเมา แก้มะเร็ง ผลดิบ รสขื่นปร่า แก้โรคในลำคอ เจ็บคอ ลำคออักเสบ",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=222"
    },{
        name:"ตับเต่า",
        otherNames:"ชิ้นกวาง เรื้อนกวาง ลิ้นกวาง มะพลับดง มะมัง ตับเต่าหลวง มะโกป่า มะไฟผี มาเมียง เฮื้อนกวาง แฮดกวาง",
        imageUrl:"http://www.qsbg.org/database/botanic_book%20full%20option/Picture/book1/Dio%20ehr%20Wal1.jpg",
        benefits:"ต้น น้ำต้มจากเนื้อไม้และราก กินเป็นยาลดไข้ ดับพิษร้อน และบำรุงปอด",
        source:"http://www.qsbg.org/database/botanic_book%20full%20option/search_detail.asp?botanic_id=809"
    },{
        name:"นางแย้มป่า",
        otherNames:"ปิ้งเห็บ ต่างไก่แดง ขี้ขม",
        imageUrl:"http://qsbg.org/Database/Botanic_Book%20full%20option/Picture/book3/Cle_vis_Ven_2.jpg",
        benefits:"สามารถนำมาปลูกเป็นไม้ประดับได้",
        source:"http://qsbg.org/Database/Botanic_Book%20full%20option/search_detail.asp?botanic_id=986"
    },{
        name:"ปลาไหลเผือก",
        otherNames:"กรุงบาดาล (สุราษฎร์ธานี); คะนาง, ชะนาง (ตราด); ตรึงบาดาล (ปัตตานี); ตุงสอ, แฮพันชั้น (ภาคเหนือ); เพียก (ภาคใต้); หยิกบ่อถองหรือหยิกไม่ถึง, เอียนด่อน (ภาคตะวันออกเฉียงเหนือ); ไหลเผือก (ตรัง);หมุนขึ้น",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph062_Plahlaipergyai/ph062_11.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้ ราก ต้มน้ำดื่ม แก้ไข้ ฝนน้ำดื่ม แก้ปวดท้อง ราก นำไปเข้ายาบำรุงกำลัง นำรากผสมกับรากโลดทะนงแดง และพญาไฟ ฝนน้ำดื่ม แก้ไข้ ใช้เลิกเหล้า รากผสมรากย่านางแดง และพญายา ฝนน้ำกินขับพิษ รากผสมกับรากโลดทะนงแดงและพญาไฟ ฝนน้ำกิน ทำให้อาเจียน ใช้เลิกเหล้า<br>ตำรายาไทย  ใช้ ราก รสขม เบื่อเมาเล็กน้อย ถ่ายพิษต่างๆ ถ่ายฝีในท้อง ถ่ายพิษไข้พิษเสมหะ และโลหิต แก้ไข้ แก้ไข้มาลาเรีย ตัดไข้ทุกชนิด แก้ลม แก้วัณโรคระยะบวม ขับเหงื่อ ขับพยาธิ แก้ต่อมทอนซิลอักเสบ แก้เจ็บคอ ความดันเลือดสูง อัมพาต ขับถ่ายน้ำเหลือง แก้ท้องผูก",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=149"
    },{
        name:"พังคี",
        otherNames:"",
        imageUrl:"https://medthai.com/wp-content/uploads/2013/12/ผลพังคี.jpg",
        benefits:"รากใช้เข้ายาแก้ไข้ โดยผสมกับสมุนไพรชนิดอื่นอีก 34 ชนิด ใช้ต้มกับน้ำดื่มแก้ไข้ (ราก) รากพังคีช่วยแก้อาการจุกเสียด แก้ท้องอืด ท้องขึ้น ท้องเฟ้อ ปวดท้อง ปวดแน่นท้อง ด้วยการใช้รากต้มกับน้ำดื่ม หรือใช้ภายนอกด้วยการนำมาฝนทาท้อง หรือใช้ฝนกับน้ำปูนใส ผสมกับมหาหิงคุ์และการบูรใช้ทาท้องเด็กอ่อนจะช่วยทำให้ผายลม หรือใช้รากพังคีผสมกับรากส่องฟ้าดงต้มกับน้ำดื่มก็ได้ (ราก) รากใช้ตำประคบแก้อาการปวด (ราก)",
        source:"https://medthai.com/พังคี/"
    },{
        name:"มะคังแดง",
        otherNames:"จงก่าขาว ตะลุมพุกแดง (กาญจนบุรี) ; จิ้งก่าขาว ชันยอด (ราชบุรี); ตุมกาแดง (กลาง) มะคัง (เชียงใหม่) มะคังป่า (กลาง เหนือ) ; มุยแดง ลุมพุกแดง (นครราชสีมา) โรคแดง",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph136_Makungdang/ph136_17.jpg",
        benefits:"ยาสมุนไพรพื้นบ้านจังหวัดอุบลราชธานี  ใช้  เปลือกต้น เข้ายากับมุ่ยขาว ทำเป็นลูกกลอน แก้ปวดเส้นเอ็น อัมพฤกษ์ อัมพาต แก้ริดสีดวงทวาร แก่น ต้มน้ำดื่มแก้ปวดเมื่อย แก้ปวดประจำเดือน แก่นผสมกับมุ่ยขาว มุ่ยแดง หนามแท่ง เล็บแมว เงี่ยงปลาดุก รักษาโรคกระเพาะอาหาร มะเร็ง<br>ยาพื้นบ้าน  ใช้  ต้น ต้มน้ำดื่ม แก้เลือดลมเดินไม่สะดวก ผสมกับหัวยาข้าวเย็น ต้มน้ำดื่มแก้ไตพิการ (โรคเกี่ยวกับทางเดินปัสสาวะ มีปัสสาวะขุ่นข้น เหลืองหรือแดง มักมีอาการแน่นท้อง กินอาหารไม่ได้) แก้ปวดท้อง ขับพิษโลหิต และน้ำเหลือง เปลือกต้น ตำพอกแผลสด ห้ามเลือด ราก เป็นยาถ่าย ไม่ระบุส่วนที่ใช้ ใช้แก้ไข้",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=91"
    },{
        name:"สะค้าน",
        otherNames:"",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/userfiles/image/tcd181_Sakan/tcd181_002.jpg",
        benefits:"ตำรายาไทย เถา รสเผ็ดร้อน ขับลมในลำไส้ แก้แน่น แก้จุกเสียด บำรุงธาตุ ทำให้ผายเรอ และใช้ปรุงยาธาตุ แก้ธาตุพิการ เป็นตัวยาประจำธาตุลม<br>บัญชียาจากสมุนไพร: ที่มีการใช้ตามองค์ความรู้ดั้งเดิม ตามประกาศคณะกรรมการพัฒนาระบบยาแห่งชาติ ในบัญชียาหลักแห่งชาติ ระบุการใช้สะค้านในตำรับ “ยาเบญจกูล” มีส่วนประกอบของเถาสะค้านร่วมกับสมุนไพรชนิดอื่นๆ ในตำรับ มีสรรพคุณบรรเทาอาการท้องอืด ท้องเฟ้อ บำรุงธาตุ แก้ธาตุให้ปกติ",
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=183"
    },{
        name:"สารภีป่า",
        otherNames:"คำโซ่ ตองหนัง ตีนจำ ทำซุง บานมา พระราม โมงนั่ง (อีสาน) ปันม้า แก้มอ้น ฮัก สุน ส้านแดง ส้านแดงใญ่ เหมือดแหล่ สารภี สารภีควาย สารภีหมู (เหนือ) สารภีดอย",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph296_Sarapeepa/ph296_007.jpg",
        benefits:"ตำรายาไทย เปลือก และดอก ใช้ถ่ายพยาธิ แก้บิด และแก้ไข้<br>ตำรายาพื้นบ้านล้านนา ทั้งต้น ผสมสมุนไพรจำพวกประดง รวม 9 ชนิด ต้มน้ำดื่มรักษาโรคประดง",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=293"
    },{
        name:"อบเชยไทย",
        otherNames:"",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/userfiles/image/tcd149_Obchei/tcd149_02.jpg",
        benefits:"ตำรายาไทย: น้ำต้มเปลือกต้น ดื่มแก้ตับอักเสบ อาหารไม่ย่อย แก้ท้องเสีย ลำไส้เล็กทำงานผิดปกติ ขับพยาธิ มีสรรพคุณบำรุงดวงจิต  แก้อ่อนเพลีย  ชูกำลัง  ขับผายลม  บำรุงธาตุ  แก้บิด  แก้ลมอัณฑพฤกษ์   แก้ไข้สันนิบาต   ใช้ปรุงเป็นยานัตถุ์แก้ปวดหัว รับประทานแก้เบื่ออาหาร  แก้จุกเสียด แน่นท้อง อาหารไม่ย่อย  แก้ไอ  แก้ไข้หวัด  ลำไส้อักเสบ  ท้องเสียในเด็ก  อาการหวัด  ปวดปะจำเดือน แก้อ่อนเพลีย  คลื่นไส้อาเจียน  แก้ปวดประจำเดือน  ห้ามเลือด บดเป็นผงโรยแผลกามโรค สมานแผล<br>อบเชยมีการนำมาใช้ในพิกัดยาไทย คือ “พิกัดตรีธาตุ” ประกอบด้วย กระวาน ดอกจันทน์ และอบเชย เป็นยาแก้ธาตุพิการ แก้ลม แก้เสมหะ แก้ไข้  “พิกัดตรีทิพย์รส” คือการจำกัดจำนวนของที่มีรสดี 3 อย่าง คือโกฐกระดูก เนื้อไม้ และอบเชยไทย มีสรรพคุณบำรุงธาตุ บำรุงกระดูก บำรุงตับปอดให้เป็นปกติ แก้ลมในกองเสมหะ บำรุงโลหิต “พิกัดจตุวาตะผล” คือการจำกัดจำนวนตัวยาแก้ลม ประกอบด้วยผล 4 อย่าง คือ เหง้าขิงแห้ง กระลำพัก อบเชยเทศ และโกฐหัวบัว มีสรรพคุณแก้ไข้ แก้พรรดึก แก้ตรีสมุฏฐาน ขับผายลม บำรุงธาตุ แก้ลมกองริดสีดวง “พิกัดทศกุลาผล” คือการจำกัดจำนวนตัวยาตระกูลเดียวกัน 10 อย่าง มีชะเอมทั้ง 2 (ชะเอมไทย ชะเอมเทศ) ลูกผักชีทั้ง 2 (ผักชีล้อม ผักชีลา) อบเชยทั้ง 2 (อบเชยไทย อบเชยเทศ) ลำพันทั้ง 2 (ลำพันแดง ลำพันขาว) ลูกเร่วทั้ง 2 (เร่วน้อย เร่วใหญ่) มีสรรพคุณ แก้ไข้เพื่อดีและเสมหะ ขับลมในลำไส้ บำรุงธาตุ บำรุงปอด แก้รัตตะปิตตะโรค แก้ลมอัมพฤกษ์ อัมพาต บำรุงกำลัง บำรุงดวงจิตให้แช่มชื่น แก้ไข้",
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=149"
    },{
        name:"เฉียงพร้านางแอ",
        otherNames:"สีฟันนางแอ (เหนือ), นกข่อ, ส้มป้อง (เชียงใหม่), บงคด (พร), โองนั่ง (อุตรดิตถ์), แก็ก, วงคด, องคต (ลำปาง), แคแห้ง, ต่อไส้, สันพร้านางแอ (กลาง), ร่มคมขวาน (กรุงเทพมหานคร), ขิงพร้า (ตราด, ประจวบคีรีขันธ์), บงมัง (ปราจีนบุรี, อุตรดิตถ์), ม่วงมัง, หมักมัง (ปราจีนบุรี), สีฟัน (ใต้), เขียงพร้านางแอ (ชุมพร)",
        imageUrl:"https://apps.phar.ubu.ac.th/phargarden/userfiles/image/images/ph222_Chiengpranangaee/ph222_007.jpg",
        benefits:"ยาพื้นบ้านอีสานใช้ ลำต้น ฝนน้ำกินแก้ไข้ ต้มน้ำดื่มบำรุงร่างกาย เป็นยาเจริญอาหารสำหรับสตรีหลังคลอด ผสมลำต้นแคด เปลือกต้นตับเต่าต้น ต้มน้ำดื่ม แก้ผิดสำแดง (กินอาหารแสลงไข้ ทำให้โรคกำเริบ อาจมีอาการท้องเสีย)  เปลือกต้น ต้มน้ำอาบรักษาไข้ตัวร้อน แก่น ช่วยขับลม ระบายความร้อน แก่น ใช้ทำเครื่องจักสาน<br>ตำรายาไทยใช้ เปลือกต้น รสฝาดเย็น แก้ไข้  แก้ร้อนในกระหายน้ำ ขับเสมหะ และโลหิต ปิดธาตุ สมานแผล แก้บิด แก้พิษผิดสำแดง ต้น แก้ไข้ บำรุงร่างกาย และช่วยเจริญอาหาร",
        source:"https://apps.phar.ubu.ac.th/phargarden/main.php?action=viewpage&pid=218"
    },{
        name:"เถาเอ็นอ่อน",
        otherNames:"",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/userfiles/image/tcd064_Taoenaon/tcd064_03.jpg",
        benefits:"ตำรายาไทย: ใช้ เถา ต้มดื่มบำรุงเส้นเอ็นให้แข็งแรง แก้เส้นเอ็นพิการ เส้นแข็ง แก้ปวดเมื่อยเส้นเอ็น แก้ขัดยอก ทำให้คลายการตึงตัว<br>เป็นสมุนไพรที่มีการนำมาใช้ในสูตรยาอบสมุนไพรเพื่อสุขภาพ โดยใช้เป็นส่วนประกอบเพิ่มเติมจากสูตรยาอบสมุนไพรหลัก เมื่อต้องการอบเพื่อรักษาอาการปวดเมื่อย ปวดหลัง ปวดเอว เป็นต้น",
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=64"
    },{
        name:"เปราะหอม",
        otherNames:"",
        imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/images/thumbnail/1499568770.jpg",
        benefits:"ตำรายาไทย หัวใต้ดิน รสเผ็ดขม สุมศรีษะเด็ก แก้หวัดคัดจมูก รับประทานขับลมในลำไส้ แก้เสมหะ เจริญไฟธาตุ แก้ลงท้อง แก้โลหิตซึ่งเจือด้วยลมพิษ<br>บัญชียาจากสมุนไพร: ที่มีการใช้ตามองค์ความรู้ดั้งเดิม ตามประกาศ คณะกรรมการแห่งชาติด้านยา ระบุการใช้เหง้าเปราะหอม ในยารักษากลุ่มอาการทางระบบทางเดินอาหาร ปรากฏในตำรับ “ยาธาตุบรรจบ” มีส่วนประกอบของเหง้าเปราะหอม ร่วมกับสมุนไพรชนิดอื่นๆ ในตำรับ มีสรรพคุณ บรรเทาอาการท้องอืดเฟ้อ และอาการอุจจาระธาตุพิการ ท้องเสียที่ไม่ติดเชื้อ และระบุการใช้เหง้าเปราะหอมร่วมกับสมุนไพรอื่นๆ ใน “ตำรับยาเขียวหอม”  สรรพคุณ บรรเทาอาการไข้ ร้อนในกระหายน้ำ แก้พิษหัด พิษอีสุกอีใส (บรรเทาอาการไข้จากหัด และอีสุกอีใส)",
        source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=154"
    },{
      name:warningIcon+"กระวาน",
      otherNames:"",
      imageUrl:"https://apps.phar.ubu.ac.th/thaicrudedrug/userfiles/image/tcd011_Krawanthai/tcd011_04.jpg",
      benefits:"ตำรายาไทย: ผลแก่ รสเผ็ดร้อน  กลิ่นหอม  ใช้แก้อาหารท้องอืด ท้องเฟ้อ ช่วยขับลม และแก้แน่นจุกเสียด มีฤทธิ์ขับลม และบำรุงธาตุ แก้ธาตุไม่ปกติ บำรุงกำลัง ขับโลหิต  แก้ลมในอกให้ปิดธาตุ  แก้ลมเสมหะให้ปิดธาตุ  แก้ลมในลำไส้ เจริญอาหาร  รักษาโรครำมะนาด  แก้ลมสันนิบาต  แก้สะอึก แก้อัมพาตรักษาอาการเบื่ออาหาร  คลื่นไส้  อาเจียน เมล็ด  แก้ธาตุพิการ  อุจจาระพิการ  บำรุงธาตุ ขับเสมหะ แก้ปวดท้อง ขับลม นอกจากนี้ยังใช้ผสมกับยาถ่ายเพื่อบรรเทาอาการไซ้ท้อง (คลื่นไส้อาเจียน)   เช่น  มะขามแขก",
      source:"https://apps.phar.ubu.ac.th/thaicrudedrug/main.php?action=viewpage&pid=11"
  }
]

const contentContainer = document.getElementById('contentContainer');

function createHerbsForm(herbs) {
    let html = `
      <div>
        <p class="h1 mb-4">“สมุนไพรไทย” <a type="text text-decoration-none" class="h1 text-danger">22</a> ชนิดเสี่ยงสูญพันธุ์</p>
        <div class="row">
            <div class="col-sm-12 col-md-12 col-lg-3">
                <img src="https://mpics.mgronline.com/pics/Images/560000000622401.JPEG" class="img-fluid mb-4" alt="..." />
            </div>
            <div class="col-sm-12 col-md-12 col-lg-9">
              <p class="h3 mb-4">สธ. ประกาศรายชื่อ “สมุนไพรไทย” 22 ชนิดเสี่ยงสูญพันธุ์ เหตุเติบโตช้า เมื่อใช้ต้องใช้ทั้งต้น หรือทั้งราก หรือใช้บ่อยจึงรักษาได้ <a type="text text-decoration-none" class="h3 text-danger">คัดเลือกสมุนไพร 7 ชนิด ออกประกาศคุ้มครองและควบคุม ผู้ครอบครองต้องแจ้งจำนวนที่มี</a> เพื่อทำแผนการใช้และการปลูกทดแทน</p>
              <p class="display-1 mb-4">นายนันทศักดิ์ กล่าวว่า คณะกรรมการคุ้มครองและส่งเสริมภูมิปัญญาการแพทย์แผนไทยได้ประชุมหารือกัน <a type="text text-decoration-none" class="h3 text-danger">โดยเลือกสมุนไพร 6 ชนิดจาก 22 ชนิดขึ้นมา คือ ถั่วดินโคก หรือ พิษนาศน์ เทพทาโร มะตูมนิ่ม มะหาด เร่ว และ หัวร้อยรู นอกจากนี้ ยังเสนอสมุนไพร “กระวาน” ขึ้นมาเป็นพิเศษด้วยอีกชนิดหนึ่ง</a> เพื่อประกาศคุ้มครองและเป็นสมุนไพรที่ต้องควบคุม โดย<a type="text text-decoration-none" class="h3 text-danger">หากใครมีสมุนไพร 7 ตัวนี้อยู่ในครอบครองไม่ได้ถือว่ามีความผิด เพียงแต่ต้องแจ้งมาทาง สธ. ให้รับทราบว่ามีอยู่เท่าใด เพื่อที่จะจัดทำแผนส่งเสริมการปลูกต่อไป</a> เช่น บริษัทใดมีสมุนไพร 7 นี้อยู่ ใช้ผลิตยาไปเท่าใด ต้องปลูกทดแทนเท่าใด เพื่อไม่ให้สูญพันธุ์ เป็นต้น
              </p>
            </div>

        </div>
        <p class="text-center h3 mb-4">รายชื่อ และ รายละเอียด สมุนไพรที่เสี่ยงสูญพันธุ์ </p>
        <div class="row">
          <div class="col-4">
            <div class="list-group" id="list-tab" role="tablist">
    `;
  
    herbs.forEach((herb, index) => {
      html += `
        <a
          class="h4 list-group-item list-group-item-action ${index === 0 ? 'active' : ''}"
          id="list-${index + 1}-list"
          data-bs-toggle="tab"
          href="#list-${index + 1}"
          role="tab"
          aria-controls="list-${index + 1}"
          aria-selected="true"
        >
          ${index + 1}. ${herb.name}
        </a>
      `;
    });
  
    html += `
            </div>
          </div>
          <div class="col-8">
            <div class="tab-content text-center" id="nav-tabContent">
    `;
  
    herbs.forEach((herb, index) => {
      const hasWarningIcon = herb.name.startsWith(warningIcon);
      html += `
        <div
          class="tab-pane fade ${index === 0 ? 'show active' : ''}"
          id="list-${index + 1}"
          role="tabpanel"
          aria-labelledby="list-${index + 1}-list"
        >
          <img id="list-${index + 1}-img" src="${herb.imageUrl}" class="img-fluid mb-4" alt="..." />
          <dl class="row">
            <dt class="h4 col-sm-4">ชื่อสมุนไพร</dt>
            <dd class="display-2 col-sm-8">${herb.name}</dd>
            <dt class="h4 col-sm-4">ชื่ออื่นๆ</dt>
            <dd class="display-2 col-sm-8">${herb.otherNames?herb.otherNames:"-"}</dd>
            <dt class="h4 col-sm-4">สรรพคุณ</dt>
            <dd class="display-2 col-sm-8">${herb.benefits}</dd>
            <dt class="h4 col-sm-4">ที่มา</dt>
            <dd class="display-2 col-sm-8">
              <a href="${herb.source}" class="link-info">${herb.source}</a>
            </dd>
            ${hasWarningIcon ? `
              <dt class="h4 col-sm-4">หากมีสมุนไพรนี้อยู่ในครอบครอง ติดต่อ สธ. <a type="text text-decoration-none" class="h4 text-danger">ทันที</a> ที่</dt>
              <dd class="display-2 col-sm-8">
                <a href="https://www.moph.go.th/index.php/contact" class="link-info">https://www.moph.go.th/index.php/contact</a>
              </dd>
            ` : ''}
          </dl>
        </div>
      `;
    });
  
    html += `
            </div>
          </div>
        </div>
      </div>
    `;
  
    return html;
  }  

  function scrollToContent(elementId) {
    const element = document.querySelector(elementId);
    if (element) {
      element.scrollIntoView();
    }
  }
  
  const formContainer = document.getElementById('contentContainer');
  formContainer.innerHTML = createHerbsForm(herbsData);